{
    "Resources": [
        {
            "name": "Business: Everything I know",
            "slug": "business-everything-i-know",
            "description": "Everything I know about business in one big fat list.",
            "image": "https://images.unsplash.com/photo-1623118176012-9b0c6fa0712d?download=true",
            "category": "Business and Entrepreneurship",
            "body": [
                {
                    "Heading": "Introduction",
                    "Paragraphs": [
                        "Business. What is business? Some may say it’s to exchange goods or services for money. And they are right, but when you look deep down, it’s simply an exchange of value for value.",
                        "I’ve been in business for a while now, and I’ve learned a lot. I’ve learned from my own mistakes, and I’ve learned from others. I’ve learned from books, and I’ve learned from experience. I’ve learned from my own business, and I’ve learned from other businesses.",
                        "You provide value to your customers in the form of goods or services, and they provide value to you in the form of income. Doing your regular day job, is a form of business even if you don’t see it as such. Albeit it’s a form of business in which you have almost no control or leverage over the situation. They tell you how much you’re going to be paid, you show up, do the job, and get paid just that. With the added drawback that they get to tell you when to show up and what to do at every moment of the day you’re working or them.",
                        "But the world does not work this way, it never has. When someone has skills that are truly in demand, they get to set their price, their hours, and everything they could desire, because they are irreplaceable. If they are gone the business is gone.",
                        "The issue with that these days is that education is a business like any other. And the ease of entry for dumb 18-year-olds to get student loans, they don’t understand is impressive, to say the least. And honestly, I have to say it, College simply isn’t that challenging, I’m sure certain degrees will be hard no matter what, but overall it’s far easier than it’s ever been.",
                        "You can teach the average person to do anything and do it well. You could probably teach an ape to do all the daily tasks your average person has to perform. This has made competition in every field the hardest it’s ever been."
                    ]
                },
                {
                    "Heading": "Why am I Writing This?",
                    "Paragraphs": [
                        "Before I can answer this question, I have to talk a little bit about myself. I am 21 years old, which some may consider too young to be writing about business, what the hell do I know right?",
                        "And maybe they are right. But what I do know is that I have dedicated a large part of my life to studying. At first, it started with science then philosophy, and lately, the sole focus of my life has been self-improvement and business.",
                        "I was originally born in Cuba, my parents lived in a small house behind my grandparent’s house. It was a living room and a bedroom, nothing else. As you can imagine things were difficult. Eventually my dad, with some help built a restroom onto the house which made life a lot easier. I remember it as one of the first luxuries I ever got.",
                        "We had running water since someone had set up all the infrastructure long before I was born. There was a “well” but it had a motor and when turned on would fill a tank that would supply both houses with water. Eventually, the motor broke and we no longer even had running water, this was one of the first true inconveniences of my life. Now occasionally we had to go out and pump the water by hand.",
                        "Eventually through the hard work of my parents, who I will be forever thankful to. We were able to leave Cuba and come to the United States, where even if you don’t make a lot of money as long as you’re willing to work, you will live comfortably.",
                        "It was tough to adapt to a whole new environment, but I managed, to the point where I somewhat consider myself more American than Cuban. Even though I wasn’t born here, I have spent the most time here.",
                        "I have been inspired by the work of many great men, some in the past, while some are still alive and continuing to grow their wealth and power. Men such as Andrew Carnegie, John Rockefeller, John P. Morgan, Thomas Edison, Bill Gates, Elon Musk, Andrew Tate, Mark Zuckerberg, and many more.",
                        "And my goal is to learn and also teach how these men were able to achieve greatness in their business. How they managed to influence entire nations and grow their wealth and power. And apply this in my own life and business to achieve the same level of success."
                    ]
                },
                {
                    "Heading": "Business Begins in Your Mind",
                    "Paragraphs": [
                        "No business can survive without the right mindset. Even if you were to have the perfect business built for you and put in front of you to run, you would likely run it to the ground. Simply because you did not acquire the mindset required to run a business like that.",
                        "Here’s a little analogy from my own life. When I was around 14 years old I became obsessed with the GNU/Linux ecosystem and began installing distros on every computer I could. Then I heard about Arch Linux, it comes with no installer or any form of GUI and could be fully customized to be exactly what I wanted.",
                        "I tried installing Arch Linux several times following outdated YouTube tutorials that would always leave me stuck at some point because I didn’t understand anything about it. Eventually, I decided to cheat and found a distro that would automatically install Arch Linux for me. But then when I had it in front of me all fully installed I had no idea what to do with it. I followed some tutorials and got a stock GUI running and started using it. Within a week my system was broken and I had no idea what I had done or how to fix it.",
                        "Not to mention it was missing many of the convenience and style features many distros had, things like video drivers, a boot-up splash screen, or even a login GUI were completely missing and I would have to go through many hurdles to enable those things.",
                        "I had to give up on the idea because I simply could not use the OS. But as I kept using other Linux distros I learned more and more until the point I was able to make sense of Arch Linux and eventually install it on my own. By this point, since I was able to install it, using the system was no issue and I learned to diagnose problems and fix them.",
                        "Eventually, I was running my custom versions of Arch Linux, made to be as beautiful, functional, and light as possible. My whole desktop used around 200MB of RAM compared to the typical 1 - 2GB of RAM required by most Operating Systems.",
                        "The struggle will teach you. Building your business is just like that, when you build it on your own you will be able to run it. Whereas if it was handed to you, you likely wouldn't have the skills nor the vision necessary to run it.",
                        "Vision is something that people often think it’s something you have to be born with. But this is completely wrong. Your vision, meaning how well you can identify opportunities, comes from your knowledge of that subject. The more you study the subject, the easier it will be for you to spot the opportunities that will make a difference in your life.",
                        "Sometimes you will be wrong, that is a risk you have to be willing to take. Being wrong is part of the process of developing your vision. How can you know what a good opportunity looks like when you haven’t seen what a bad one looks like? The unfortunate reality is, you will have to learn by trial and error, how to identify the opportunities that will bring you growth."
                    ]
                },
                {
                    "Heading": "The Required Mindset",
                    "Paragraphs": [
                        "In the time I have spent in sales, business, and self-development, I have seen a specific mindset show up everywhere.",
                        "It’s called “The Growth Mindset”, what it means is that you believe you’re capable of growth. If you put in the effort and the hours, you will get the results. It means you can do anything anyone else can do, and even things no one has ever done before if you keep putting in the work every single day. It means you can learn anything, I’m sure you get the picture by now.",
                        "But I can’t stress the importance of this mindset enough. In the book “Think and Grow Rich” written by the popular author Napoleon Hill. He talks about this mindset and philosophy, that he has observed in several of the men and women he considers to have built something great.",
                        "And it seems to me like almost every successful person, whether they know it or not is embodying this philosophy in some way.",
                        "Your success is a simple reflection of your work, when you put in more work you get exponentially better results from it.",
                        "You have to always believe that your work will pay off, and never be afraid to try something because you’re too scared that it might fail. You should never be scared to fail, you should welcome failure as it is the best way to learn new lessons.",
                        "And you have to embrace the uncertainty of life and business, to accept that it won’t always go your way, sometimes it will go miserably with no lesson to be seen, nor any explanation as to why it happened, but you have to move on and keep going. Because if you give up you’re admitting you aren’t good enough to do it."
                    ]
                },
                {
                    "Heading": "Confidence",
                    "Paragraphs": [
                        "Confidence is something that will be necessary every step of the way. You have to be confident that you’ll succeed. You have to be confident that your product will help your customers. You have to be confident you can deliver on your word.",
                        "There will be many moments of doubt, and you won’t just have to make yourself confident in your abilities, you will have to make others confident in them also.",
                        "The best way to build confidence is to risk being embarrassed. First, you have to practice whatever skill you’re trying to learn, then you have to show it to others.",
                        "They will judge your work and one of two things will happen, they’ll love it or hate it. Sometimes what they tell you is not what they are thinking but it’s your job to find people who will tell you what they are thinking, and at the end of the day, you will know by their reaction to it.",
                        "Depending on your skills this will either be a confidence booster or an embarrassing failure. If you fail, it’s your job to not quit and keep improving until you prove those who made you feel embarrassed wrong.",
                        "Once you do this, your confidence will be stronger than ever. I believe it’s necessary to go through times of high confidence in oneself only for it to be crushed, and rebuilt again even stronger the next time.",
                        "Every time you rise from defeat you will be exponentially stronger than you were before. And you’ll be able to see it too. If you did what you were supposed to, you are now far better than you were before, to a degree where you will feel like you were a complete beginner before, and now you’re an expert.",
                        "Don’t worry you’ll have your moment when you get knocked right back down. So enjoy your moment of glory while it lasts."
                    ]
                },
                {
                    "Heading": "Nothing Lasts Forever",
                    "Paragraphs": [
                        "If there is one thing that I know for a fact, is that nothing is permanent. Things can change before you even know it. When I was growing up and ready to go to College, everyone was telling me that Computer Science was a great career choice and that there was going to be a crazy demand in the field. But everyone else also taught the same as me and now the field is full of people and we’re all at risk of being replaced by AI once it’s able to do our jobs.",
                        "Many multi-million dollar companies have found themselves in a position where their business model became unsustainable all of a sudden because of some new technology and to the ground they come crashing, unable to react in time to save the company.",
                        "When it comes to business you have to know that just because it was working last year doesn’t mean it will work this year, and you have to be ready to figure out how to keep doing what you were doing or how to do something else. If you do not adapt to the changing circumstances your company will die.",
                        "Failing to adapt or believing that your business will continue to grow forever is one of the worst mistakes possible.",
                        "If you have times of easy growth, you should use it to prepare for the moment it ends. Because more than likely it will end, and if you’re not ready your business will die. Another important thing is to not overextend.",
                        "Make sure you pay yourself first. Your business is important and you’ve worked hard to make it grow and live but at the end of the day, it’s got to make you money. Invest your profits back into the company but always make sure you pay yourself.",
                        "If your company ever fails, and as unfortunate as it is, all good things come to an end, you won’t have to start over from zero after putting 5 or 10 years of your life into it. Put your earnings into a stock portfolio, or some other form of money-earning asset, or even any other means of earning money, so long as you don’t spend it all. It’s important to be ready for the day when your business will die. Even if it never happens it won’t hurt to be ready."
                    ]
                }
            ]
        },
        {
            "name": "A guide to websites.",
            "slug": "a-guide-to-websites",
            "description": "A guide to websites.",
            "image": "https://unsplash.com/photos/hpjSkU2UYSU/download?force=true&w=1920",
            "category": "Web Design and Development",
            "body": [
                {
                    "Heading": "A website with a purpose",
                    "Paragraphs": [
                        "Your website, and more specifically your landing page has a purpose, a goal.",
                        "The goal of most websites is to get a lead who clicked on the website, to take action. That action can be, visiting a link, buying something, scheduling a call, or really anything you want the users to do.",
                        "It might seem like their goal is to solve the clients' problems or accomplish a task, but the real goal is always to either directly buy from you or schedule a sales meeting.",
                        "It should turn a curious person who clicked because they wanted to find out more into a client that will buy from you.",
                        "And trust me, there's a lot that goes into this. First, you need to get people to go to your website.",
                        "According to Google, there are around 1.13 billion websites on the internet. It's not free to host a website, no matter how you look at it, even if you own your own servers you still have to pay the lights. So we can assume that most websites online have the goal of selling you something. I mean just look around online. And even the ones that don't make it obvious, it's because they're not selling to you, they're selling you to corporations.",
                        "That's a hell of a lot of competition. If you don't actively advertise your website any way you can, such as forums, other websites, or social media, no one will find it. Believe it or not, this is part of SEO (Search Engine Optimization). And this is one part of SEO that every business owner should learn.",
                        "The other part of SEO falls to whoever is building your website, as it must be done within the code. On-page SEO is made up of the title, description, keywords, and images that will show up on Google or your website links.",
                        "Getting your SEO right is absolutely crucial. For people to buy from you, you need them to get to your website in the first place. When you post your website link on your Twitter bio or advertise it in a Tweet, you're doing SEO.",
                        "The next step is to collect and analyze data on how many users visit, how they interact with your site, etc. This will show you exactly what is going on behind the scenes. Which avenues are bringing more traffic to your site and which pages are being visited more? You can get a sense of what is working and what isn't working, and capitalize on your victories while learning from your failures.",
                        "Next, you need to make sure your site looks good, is easy to navigate and there's a simple easy-to-follow path to the golden ticket. Every part of your website should lead to the next, and guide the user to where you want them to go. You need to plan every step of the way that the user will take.",
                        "You need to have clear, defined goals for your website. This will guide you when making decisions and make it easier to figure out what to include.",
                        "You need to have an efficient, and clear copy. You need to show your client, exactly how you will help them, and why they should buy your product.",
                        "You need to put constant effort into it. If you're working on your own websites, you're in for a long grueling journey to learn everything you need to learn. If you're working with a developer, you need to work closely with them in order for them to better assess your needs and deliver a service that will actually help your business.",
                        "They will do a good deal of the work, but they can't do everything. Some parts of your website are heavily dependent on your brand and your work. And so it's extremely important to work together in order to create the best possible website!"
                    ]
                },
                {
                    "Heading": "Why a landing page?",
                    "Paragraphs": [
                        "You have or want to start a business in which you offer a service to your customers. You may already be having good luck promoting your business on social media and maybe linking to Calendly or Linktree or even Gumroad.",
                        "But you always link to something, you can't really sell on social media without communicating with the person.",
                        "Social media is an amazing tool for getting discovered and finding potential clients but it should always be used as a bridge to something else.",
                        "Something that will show off who you are and what you do. Something that will leave the customers not be able to wait to talk to you.",
                        "We call this a landing page! On this page, you pitch your sale. You show what your business is all about and what you could help the client with, be it solving a problem, saving them time or money, or making them money.",
                        "The main goal of a landing page should always be to get the customer to do something, usually scheduling a meeting with you is a really good way to calm their fears about an online business.",
                        "Social media can also be censored, you could get banned, the platform could go down, or any number of things that would leave you unable to access your business which is entirely run on social media, you would lose everything!",
                        "A landing page is a way to take control of your profile. Your landing page is like your expanded social media profile where you can put anything you want on it with no restrictions. It allows you to be you!",
                        "A landing page will make you look professional and serious about what you're promoting. You should be, but nonetheless, a good-looking landing page is not an easy task and your customers will notice that you've put in the work!"
                    ]
                },
                {
                    "Heading": "Intro to HTML",
                    "Paragraphs": [
                        "HTML is a very simple 'language'. I say 'language' in quotes because it is completely different from most modern programming languages, and it is not able to perform the same level of tasks.",
                        "HTML is mainly only used to define UI components and their properties. You could say it's kind of like the skeleton of your website. It's what defines the main structure of the page and where you choose what components to add.",
                        "Every component in HTML is called a tag. Tags are simply the simple components that make up your page. Some examples of these tags include:",
                        "- div: Divider",
                        "- h1 - h6: Headers 1 - 6",
                        "- p: Paragraph",
                        "- button: Button",
                        "- a: Link",
                        "- input: User input",
                        "With just the previous 6 tags, you can create a wide array of different websites, especially when getting into the properties of the tags which allows us to further customize how they are used within our page.",
                        "Examples of common HTML tag properties that can be used are:",
                        "- id",
                        "- class",
                        "- name",
                        "- type",
                        "- Event listeners",
                        "The last one is particularly important because it's how your site will be able to react to different things that the user does on your website such as hovering or clicking on a component."
                    ]
                },
                {
                    "Heading":"Intro to CSS",
                    "Paragraphs": [
                        "CSS. Oh CSS, how much I love and hate you at the same time.",
                        "I will tell you right now, CSS is probably the most important language you will use for a website.",
                        "CSS is the language you use to style your website, and it is extremely powerful. If you want to see the power of CSS for yourself, find a way to disable the CSS of a website and see how it looks.",
                        "It will look unrecognizable. Elements will not be positioned correctly, there will be no colors or any sort of styling at all. The website will literally look like it was made at the beginning of the internet.",
                        "But CSS is here to change all that! The basics of it are very simple, there are selectors and properties. Selectors allow you to target a specific HTML class or element while properties are the properties you can change within those selectors.",
                        "The syntax for CSS is very simple. To use a selector, all you need is a '#' if selecting by id or a '.' if selecting by class. Followed by open and close brackets.",
                        "At first, CSS will be confusing, and it will be hard to position elements, and I especially struggled with getting my websites to look right on multiple screen sizes.",
                        "But after a while of using it, it will become intuitive and easier to just think of something and remake it in CSS.",
                        "There are many different properties that are used within CSS, but some get used a lot more than others.",
                        "Things such as display, position, margin, font-size, background-color, color, etc...",
                        "For many of these, especially the margins, paddings, and borders, it's important to understand the CSS box model.",
                        "Pretty much every single element in CSS follows the box model. The box model will allow you to understand specifically how the margins, borders, and padding work.",
                        "The margins will always refer to empty spaces outside or around the element. Then the border is, as the name implies, a border right at the edge of the element. Then the padding is empty space inside your elements that will separate the content from the edges of the element.",
                        "You can also set a negative margin or padding to reduce the empty space, it will really do what you think it does.",
                        "Next, we'll talk about layouts. CSS has several layouts such as box, flex, and grid.",
                        "The box layout is the default layout, elements are automatically stacked on top of each other, and you can only use the margins to position elements correctly.",
                        "Next, we'll move on to the flex layout. Flex layout is one of the best and still the favorite of many, including myself. Flex allows you to make lists either vertically or horizontally, it also offers several positioning modes which you can use in the justify-content property, such as space-evenly, space-around, and space-between. Flex layout allows for amazing control over lists and by using flex containers within another flex container, we can even achieve grids!",
                        "Grid is much like flex but it allows for full grids and offers a different way to position your elements within the grid!",
                        "As you can see, there's a lot to master when it comes to CSS, but it's important to know that we all sucked at it when we first started. You'll get better at it over time, you just need to practice and work on many different websites before you're able to create beautiful and stunning websites!"
                    ]
                },
                {
                    "Heading": "Intro to JavaScript",
                    "Paragraphs": [
                        "Javascript is an interesting programming language. It's possibly the first language ever made to work within a browser, and contrary to what many may believe, it's not a single language. Javascript, HTML, and CSS are more like standards browsers have to implement. The creator of Javascript made it with a syntax very similar to that of Java while taking away features that made Java extremely annoying.",
                        "Unlike HTML and CSS, however, Javascript is a different beast. Javascript is a full-fledged programming language, and while its primary purpose is to program the logic in websites, you can make use of Javascript for much more. Examples of this include making use of Electron to develop desktop applications or React Native for mobile applications. I will have to warn you. To learn Javascript, you have to master the concepts of programming.",
                        "Are you ready? Let's begin!",
                        "The first concept we need to get familiar with within programming is variables. Variables are the soul of any program. Variables store data of an arbitrary type, usually set by the language. The value of variables can be changed at any point in your code unless we assign them to be constant.",
                        "Creating a variable in Javascript is simple. We use the 'var' or 'let' keyword followed by an identifier. An identifier can be almost anything, and the rules can vary from language to language. Typically, it can contain any letters, numbers, or symbols, but they can only start with a letter or underscore.",
                        "let myNumberVariable = 35",
                        "let myStringVariable = 'Hello World'",
                        "let myBooleanVariable = true",
                        "As you can see, we also need to assign a value to the variables we create. We can achieve this by using a single '=' followed by the value we want to give the variable. The value of variables can be a number, string, or boolean. There are more, but in Javascript, they look the same, and it makes no sense to name them all.",
                        "The next concept is functions. Functions are what they sound like. If you've ever taken an algebra class, you likely learned what they are. They take in an input and produce an output. In Javascript and almost every other programming language, functions do the exact same. To create a function in Javascript, we use the 'function' keyword followed by an identifier, comma-separated parameters surrounded by parenthesis, and open and close brackets.",
                        "function sayHello() {",
                        "console.log('Hello')",
                        "}",
                        "function add(num1, num2) {",
                        "return num1 + num2",
                        "}",
                        "function getLetterFromNumber(number) {",
                        "let letters = [",
                        "'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k',",
                        "'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v',",
                        "'w', 'x', 'y', 'z'",
                        "]",
                        "return letters[number - 1]",
                        "}",
                        "function printLetter26() {",
                        "console.log(getLetterFromNumber(26))",
                        "}",
                        "As you can see, functions are extremely versatile in their use. I can tell you, I don't know what I'd do without them.",
                        "Next, we will tackle conditionals. Conditionals are simple, they check if something is true, and if it is, you do something; otherwise, you do something else. To use conditionals, we use the 'if' keyword followed by the expression we want to check surrounded by parenthesis.",
                        "if (3 < 4) {",
                        "console.log('3 is smaller than 4')",
                        "}",
                        "else {",
                        "console.log('your computer is melting, probably')",
                        "}",
                        "if (randomVariable >= 25) {",
                        "console.log('number is bigger or equal to 25')",
                        "}",
                        "else {",
                        "console.log('number is smaller than 25')",
                        "}",
                        "And you can use this in a variety of different situations, the same as functions. You can use if statements inside of other if statements, and functions inside other functions. Conditionals allow your code to branch off to allow it to cover different situations and react to them.",
                        "The last concept I want to go over in this guide is loops. Loops allow you to run some code multiple times. There are two kinds of loops, for loops and while loops. For loops will only run a specified amount of times, while while loops will run for as long as a condition remains true. Here's how you do these!",
                        "for (let i = 0; i < 25; i++) {",
                        "console.log(i)",
                        "}",
                        "The previous statement would print out numbers from 0 to 24. In programming, the first number is always 0 and not 1. So if you want to loop from 1 to 25, you will loop from 0 to 24. You don't need to enforce this all the time, and when designing an app or website, you likely won't want the first page to be 0, so you can add 1 when you show the page number. However, when using arrays, sticking to 0 as the first number will save you a lot of headaches.",
                        "Here's a while loop!",
                        "while (true) {",
                        "//Do stuff <-- This is a comment. Comments don't count as code :)",
                        "}",
                        "The previous statement would actually produce an infinite loop because we never set the condition to false. In this scenario, we would want to use a boolean variable and set it to false after the loop has run enough times. Or use a counter and set the condition as the loop will end after the counter reaches a certain number.",
                        "while (myBoolean) {",
                        "//Do stuff",
                        "}",
                        "let counter = 0",
                        "while (counter < 35) {",
                        "//Do stuff",
                        "counter++ <-- The ++ is equivalent to counter = counter + 1",
                        "}",
                        "This tutorial was a basic overview of the concepts of programming. I hope you enjoyed reading through it and learned something new. I wish you the best in your journey of learning to code. I will be posting more advanced tutorials in the future, but for now, practice and learn!"
                    ]
                },
                {
                    "Heading": "The power of SEO",
                    "Paragraphs": [
                        "SEO or Search Engine Optimization is the ability to optimize your content to achieve better results in the rankings of search engines, social media, and any other kind of online area.",
                        "The goal of SEO can be summed up in one single sentence. To make the content of your page align with what the users of your page are looking for. Essentially to make your content as close as possible to what they are looking for.",
                        "SEO isn't just one thing though. There are several kinds of SEO. In fact, any time you post a link to your website, you're doing a form of SEO.",
                        "The two most common forms of SEO are on-page and off-page. On-page has to do with the contents of your page, titles, keywords, images, and text. And it also has to do with the code of the page, the HTML tags used, as well as the META tags.",
                        "Off-page SEO is the most important form of SEO. This is where you link back to your site. The more backlinks you can create for your site, the more visitors you will have.",
                        "When it comes to SEO, however, there's one crucial thing to keep in mind. The most important thing you can do is match the user's needs perfectly. What this means is that if you're selling PC parts, for example, different pages on your site will be dedicated to different things and therefore have to have different descriptions and keywords. Some pages might be informational and as such you want to use key phrases such as 'How to build a PC on a budget' or 'The most essential parts for any PC build'. Then on these pages, you would include a backlink to your store page.",
                        "However, on your store page, you would want to use key phrases such as 'Buy the latest gaming hardware at the best price' or 'Best price for the best gaming experience'.",
                        "This will attract customers who are ready to buy straight to your store, while the customers who want more information will be directed to pages with information, and then be given the opportunity to head to your store if they decide to buy.",
                        "And you can look all around you. Every single store out there does this. Your own website should contain backlinks to other pages on your site where you want to lead your customers too.",
                        "SEO is really like creating a giant funnel, it starts with social media or a search engine such as Google. Here you can post links to your landing page, your store, and any blogs you have written, and from there you can funnel your visitors into any other website or page you want.",
                        "Even if you don't realize it, you've likely already been doing a bit of SEO. But it's still important to understand how it works because by knowing its power you can grow exponentially!"
                    ]
                }
            ]
        }
    ]
}